<template>
    <ContentArticle banner="/images/photos/safe-space.jpg">
        <template #title>Безопасное пространство</template>

        <p>
            Для нашей студии и меня лично крайне важно обеспечить твой эмоциональный комфорт.
        </p><br />
        
        <p>
            Ты всегда можешь уточнить когерентное тебе местоимение, поговорить о своей девушке/парне, 
            обсудить новую татуировку или крестины племянников!
        </p><br />

        <p>
            Возможно мне будет сложно поддержать разговор на политические темы, 
            но я уверен, что мы найдем много других, более интересных точек соприкосновения!
        </p><br />

        <p>
            Взамен я прошу у Тебя относиться ко мне и моей работе уважительно, 
            без фамильярности. Пока Ты, как и ножницы в моих руках — мы друзья.
        </p><br />

        <p>
            А ещё я люблю черный юмор, совсем чуть-чуть, вот столечко 🤏.
        </p>

    </ContentArticle>
</template>

<style lang="scss" scoped>
    .color-picker {
        font-size: 0.94rem;
        font-weight: 500;
        margin: 12px 0 24px 0;

        p {
            margin-bottom: 6px;
        }
    }
</style>